const Map<String, double> emotionScores = {
  '기쁨': 90,
  '흥분': 100,
  '만족스러움': 80,
  '자신하는': 70,
  '뿌듯함': 70,
  '설렘': 80,

  '안도': 20,
  '감사함': 30,
  '여유로움': 40,
  '편안함': 50,
  '무난함': 10,

  '당황': -20,
  '부끄러움': -20,
  '놀람': -10,
  '혼란스러움': -30,

  '걱정': -50,
  '불안': -70,
  '두려움': -80,

  '불편함': -50,
  '억울함': -40,
  '부러움': -30,
  '답답함': -50,
  '후회': -60,
  '죄책감': -70,

  '괴로움': -90,
  '지침': -70,
  '무기력': -70,
  '허무함': -70,
  '좌절감': -80,

  '자괴감': -80,
  '짜증': -60,
  '혐오': -70,
  '불쾌함': -60,
  '분노': -70,

  '슬픔': -70,
  '우울함': -100,
  '속상함': -60,
  '실망': -50,
  '외로움': -60,
};