const Map<String, double> emotionScores = {
  '기쁨': 9,
  '흥분': 10,
  '만족스러움': 8,
  '자신하는':7,
  '뿌듯함': 7,
  '설렘': 8,

  '안도': 2,
  '감사함': 3,
  '여유로움': 4,
  '편안함': 5,
  '무난함': 1,

  '당황': -2,
  '부끄러움': -2,
  '놀람': -1,
  '혼란스러움': -3,

  '걱정': -5,
  '불안': -7,
  '두려움': -8,

  '불편함': -5,
  '억울함': -4,
  '부러움': -3,
  '답답함': -5,
  '후회': -6,
  '죄책감': -7,

  '괴로움': -9,
  '지침': -7,
  '무기력': -7,
  '허무함': -7,
  '좌절감': 8,

  '자괴감': -8,
  '짜증': -6,
  '혐오': -7,
  '불쾌함': -6,
  '분노': -7,

  '슬픔': -7,
  '우울함': -10,
  '속상함': -6,
  '실망': -5,
  '외로움': -6,
};